andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/drivers/src/nrfx_grtc.c
/*
 * Copyright (c) 2021 - 2026, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <nrfx.h>
#if NRFX_CHECK(NRFX_GRTC_ENABLED)

#include <nrfx_grtc.h>
#include <helpers/nrfx_flag32_allocator.h>

#define NRFX_LOG_MODULE GRTC
#include <nrfx_log.h>

#if NRFY_GRTC_HAS_EXTENDED
#define GRTC_ACTION_TO_STR(action)                                                     \
    (action == NRFX_GRTC_ACTION_START ? "NRFX_GRTC_ACTION_START" : \
    (action == NRFX_GRTC_ACTION_STOP  ? "NRFX_GRTC_ACTION_STOP"  : \
    (action == NRFX_GRTC_ACTION_CLEAR ? "NRFX_GRTC_ACTION_CLEAR" : \
                                        "UNKNOWN ACTION")))
#endif

#define GRTC_CHANNEL_TO_BITMASK(chan)          NRFX_BIT(chan)
#define GRTC_CHANNEL_MASK_TO_INT_MASK(ch_mask) ((ch_mask) << GRTC_INTEN0_COMPARE0_Pos)

#if !defined(NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK)
#error "Channels mask for GRTC must be defined."
#endif

#if !defined(NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS)
#error "Number of channels for GRTC must be defined."
#endif

#if !defined(NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK)
#if NRFY_GRTC_HAS_INTERVAL
#define NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK NRFX_BIT(0)
#elif  NRFY_GRTC_HAS_MINTERVAL
#define NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK
#else
#define NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK 0
#endif
#endif

#if NRF_GRTC_HAS_RTCOUNTER
#define GRTC_NON_SYSCOMPARE_INT_MASK   (NRF_GRTC_INT_RTCOMPARE_MASK     | \
                                        NRF_GRTC_INT_RTCOMPARESYNC_MASK | \
                                        NRF_GRTC_INT_SYSCOUNTERVALID_MASK)
#define GRTC_ALL_INT_MASK              (NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK | \
                                        GRTC_NON_SYSCOMPARE_INT_MASK)
#define GRTC_RTCOUNTER_CC_HANDLER_IDX  NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS
#define GRTC_RTCOUNTER_COMPARE_CHANNEL NRF_GRTC_SYSCOUNTER_CC_COUNT
#else
#define GRTC_ALL_INT_MASK              (NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK)
#endif // NRF_GRTC_HAS_RTCOUNTER

/* The maximum SYSCOUNTERVALID settling time equals 1x32k cycles + 20x16MHz cycles. */
#define GRTC_SYSCOUNTERVALID_SETTLE_MAX_TIME_US 33

/* The timeout for the SYSCOUNTER's ready state after starting it. */
#define STARTUP_TIMEOUT ((SystemCoreClock / 1000000U) * GRTC_SYSCOUNTERVALID_SETTLE_MAX_TIME_US)

typedef struct
{
    nrfx_drv_state_t                    state;                                                 /**< Driver state. */
    nrfx_atomic_t                       available_channels;                                    /**< Bitmask of available channels. */
    uint32_t                            used_channels;                                         /**< Bitmask of channels used by the driver. */
    nrfx_grtc_channel_t                 channel_data[NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS + 1]; /**< Channel specific data. */
    uint8_t                             ch_to_data[NRF_GRTC_SYSCOUNTER_CC_COUNT];              /**< Mapping of channel index to channel_data index. */
    uint64_t                            cc_value[NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS];         /**< Last CC value. */
    nrfx_atomic_t                       read_cc_mask;                                          /**< Indicating if CC value must be passed to the handler. */
#if NRF_GRTC_HAS_RTCOUNTER
    nrfx_grtc_rtcomparesync_handler_t   rtcomparesync_handler;                                 /**< User handler corresponding to rtcomparesync event.*/
    void *                              rtcomparesync_context;                                 /**< User context for rtcomparesync event handler. */
#endif
#if NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
    nrfx_grtc_syscountervalid_handler_t syscountervalid_handler;                               /**< User handler corresponding to syscountervalid event. */
    void *                              syscountervalid_context;                               /**< User context for syscountervalid event handler. */
#endif
} nrfx_grtc_cb_t;

static nrfx_grtc_cb_t m_cb =
{
    // At the initialization only channels assigned by configuration are available.
    .available_channels = (nrfx_atomic_t)NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK
};

static uint8_t num_of_channels_get(uint32_t mask)
{
    uint8_t ch_count = 0;

    while (mask)
    {
        // Calculating number of channels by counting ones inside given mask.
        ch_count += mask & 0x1;
        mask >>= 1;
    }
    return ch_count;
}

static uint32_t allocated_channels_mask_get(void)
{
    return NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK & ~m_cb.available_channels;
}

static uint32_t used_channels_mask_get(void)
{
    return NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK & m_cb.used_channels;
}

#if NRFY_GRTC_HAS_EXTENDED
static bool is_syscounter_running(void)
{
    return nrfy_grtc_sys_counter_check(NRF_GRTC);
}
#endif

static bool is_channel_used(uint8_t channel)
{
    return (GRTC_CHANNEL_TO_BITMASK(channel) & used_channels_mask_get());
}

static bool is_channel_allocated(uint8_t channel)
{
    return (GRTC_CHANNEL_TO_BITMASK(channel) & allocated_channels_mask_get());
}

