andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/drivers/src/nrfx_grtc.c
static void channel_used_mark(uint8_t channel)
{
    m_cb.used_channels |= GRTC_CHANNEL_TO_BITMASK(channel);
}

static void channel_used_unmark(uint8_t channel)
{
    m_cb.used_channels &= ~GRTC_CHANNEL_TO_BITMASK(channel);
}

static bool is_channel_available(uint8_t channel)
{
    return (GRTC_CHANNEL_TO_BITMASK(channel) & NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK);
}

static int syscounter_check(uint8_t channel)
{
    if (!is_channel_available(channel))
    {
        return -EPERM;
    }
    if (!is_channel_allocated(channel))
    {
        return -EINVAL;
    }
    return 0;
}

static int channel_allocate(uint8_t * p_channel, uint32_t mask)
{
    int rv;

    NRFX_CRITICAL_SECTION_ENTER();
    mask &= m_cb.available_channels;
    rv = nrfx_flag32_alloc((nrfx_atomic_t*)&mask);
    if (rv >= 0)
    {
        m_cb.available_channels &= ~NRFX_BIT(rv);
        *p_channel = (uint8_t)rv;
        rv = 0;
    }
    NRFX_CRITICAL_SECTION_EXIT();
    return rv;
}

static int channel_free(uint8_t channel)
{
    return nrfx_flag32_free(&m_cb.available_channels, channel);
}

static uint8_t get_channel_for_ch_data_idx(uint8_t idx)
{
    uint32_t ch_mask = NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK;

    for (uint8_t i = 0; i < idx; i++)
    {
        ch_mask &= ~(1UL << NRF_CTZ(ch_mask));
    }
    return (uint8_t)NRF_CTZ(ch_mask);
}

static void cc_channel_prepare(nrfx_grtc_channel_t * p_chan_data)
{
    NRFX_ASSERT(p_chan_data);
    uint8_t ch_data_idx = m_cb.ch_to_data[p_chan_data->channel];

    nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, p_chan_data->channel);

    m_cb.channel_data[ch_data_idx].handler   = p_chan_data->handler;
    m_cb.channel_data[ch_data_idx].p_context = p_chan_data->p_context;
    m_cb.channel_data[ch_data_idx].channel   = p_chan_data->channel;
    channel_used_mark(p_chan_data->channel);
}

#if NRFY_GRTC_HAS_EXTENDED
static void sleep_configure(nrfx_grtc_sleep_config_t const * p_sleep_cfg)
{
    nrfy_grtc_sys_counter_auto_mode_set(NRF_GRTC, p_sleep_cfg->auto_mode);
    nrfy_grtc_timeout_set(NRF_GRTC, p_sleep_cfg->timeout);
    nrfy_grtc_waketime_set(NRF_GRTC, p_sleep_cfg->waketime);
}

static void sleep_configuration_get(nrfx_grtc_sleep_config_t * p_sleep_cfg)
{
    p_sleep_cfg->auto_mode = nrfy_grtc_sys_counter_auto_mode_check(NRF_GRTC);
    p_sleep_cfg->timeout = nrfy_grtc_timeout_get(NRF_GRTC);
    p_sleep_cfg->waketime = nrfy_grtc_waketime_get(NRF_GRTC);
}
#endif /* NRFY_GRTC_HAS_EXTENDED */

static inline bool active_check(void)
{
    return nrfy_grtc_sys_counter_active_check(NRF_GRTC);
}

static inline void active_set(bool active)
{
    nrfy_grtc_sys_counter_active_set(NRF_GRTC, active);
}

static inline bool ready_check(void)
{
    return nrfy_grtc_sys_counter_ready_check(NRF_GRTC);
}

bool nrfx_grtc_active_request_check(void)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    return active_check();
}

void nrfx_grtc_active_request_set(bool active)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    active_set(active);
}

bool nrfx_grtc_ready_check(void)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    return ready_check();
}

uint64_t nrfx_grtc_syscounter_get(void)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);
    uint64_t val;

#if !(NRFX_CHECK(ISA_ARM) && (__CORTEX_M == 33U))
    /* On ARM Cortex-M33 there is a double word read instruction so no need for locking. */
    NRFX_CRITICAL_SECTION_ENTER();
#endif
    val = nrfy_grtc_sys_counter_get(NRF_GRTC);
#if !(NRFX_CHECK(ISA_ARM) && (__CORTEX_M == 33U))
    NRFX_CRITICAL_SECTION_EXIT();
#endif

    return val;
}

void nrfx_grtc_channel_callback_set(uint8_t                channel,
                                    nrfx_grtc_cc_handler_t handler,
                                    void *                 p_context)
{
    uint8_t ch_data_idx = m_cb.ch_to_data[channel];

    m_cb.channel_data[ch_data_idx].handler = handler;
    m_cb.channel_data[ch_data_idx].p_context = p_context;
    m_cb.channel_data[ch_data_idx].channel = channel;
    nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(channel));
}

int nrfx_grtc_channel_alloc(uint8_t * p_channel)
{
    return channel_allocate(p_channel, UINT32_MAX);
}

int nrfx_grtc_extended_channel_alloc(uint8_t * p_channel)
{
    return channel_allocate(p_channel, NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK);
}

int nrfx_grtc_channel_free(uint8_t channel)
{
    NRFX_ASSERT(channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
    int err_code;

    channel_used_unmark(channel);
    if (!is_channel_available(channel))
    {
        err_code = -EPERM;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    return channel_free(channel);
}

bool nrfx_grtc_is_channel_used(uint8_t channel)
{
    return is_channel_used(channel);
}

int nrfx_grtc_init(uint8_t interrupt_priority)
{
    int err_code = 0;

    if (m_cb.state != NRFX_DRV_STATE_UNINITIALIZED)
    {
        err_code = -EALREADY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

#if NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART)
    nrfx_grtc_sleep_config_t sleep_cfg = NRFX_GRTC_SLEEP_DEFAULT_CONFIG;
#if !NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOEN)
    sleep_cfg.auto_mode = false;
#endif

    nrfy_grtc_sys_counter_set(NRF_GRTC, false);
    sleep_configure(&sleep_cfg);
#endif

    if ((num_of_channels_get(NRFX_GRTC_CONFIG_ALLOWED_CC_CHANNELS_MASK) !=
         NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS) || (NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS == 0))
    {
        err_code = -ECANCELED;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    for (uint8_t i = 0; i < NRFX_GRTC_CONFIG_NUM_OF_CC_CHANNELS; i++)
    {
        uint8_t ch = get_channel_for_ch_data_idx(i);

        m_cb.channel_data[i].channel = ch;
        m_cb.ch_to_data[ch] = i;
    }

