andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/drivers/src/nrfx_grtc.c
    nrfy_grtc_int_init(NRF_GRTC, GRTC_ALL_INT_MASK, interrupt_priority, false);

#if NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART)
    nrfy_grtc_prepare(NRF_GRTC, true);

#endif /* NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART) */

    m_cb.state = NRFX_DRV_STATE_INITIALIZED;
    NRFX_LOG_INFO("GRTC initialized.");
    return err_code;
}

#if NRFY_GRTC_HAS_EXTENDED
void nrfx_grtc_sleep_configure(nrfx_grtc_sleep_config_t const * p_sleep_cfg)
{
    NRFX_ASSERT(p_sleep_cfg);
    bool is_active;

    is_active = nrfy_grtc_sys_counter_check(NRF_GRTC);
    if (is_active)
    {
        nrfy_grtc_sys_counter_set(NRF_GRTC, false);
    }
    sleep_configure(p_sleep_cfg);
    if (is_active)
    {
        nrfy_grtc_sys_counter_set(NRF_GRTC, true);
    }
}

void nrfx_grtc_sleep_configuration_get(nrfx_grtc_sleep_config_t * p_sleep_cfg)
{
    NRFX_ASSERT(p_sleep_cfg);
    sleep_configuration_get(p_sleep_cfg);
}
#endif // NRFY_GRTC_HAS_EXTENDED

#if NRF_GRTC_HAS_RTCOUNTER
int nrfx_grtc_rtcounter_cc_disable(void)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    int err_code = 0;
    uint32_t   int_mask = NRF_GRTC_INT_RTCOMPARE_MASK | NRF_GRTC_INT_RTCOMPARESYNC_MASK;

    if (is_syscounter_running())
    {
        err_code = -ECANCELED;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    if (nrfy_grtc_int_enable_check(NRF_GRTC, int_mask))
    {
        nrfy_grtc_int_disable(NRF_GRTC, int_mask);
        if (nrfy_grtc_event_check(NRF_GRTC, NRF_GRTC_EVENT_RTCOMPARE) ||
            nrfy_grtc_event_check(NRF_GRTC, NRF_GRTC_EVENT_RTCOMPARESYNC))
        {
            nrfy_grtc_event_clear(NRF_GRTC, NRF_GRTC_EVENT_RTCOMPARE);
            nrfy_grtc_event_clear(NRF_GRTC, NRF_GRTC_EVENT_RTCOMPARESYNC);
            err_code = -ETIMEDOUT;
            NRFX_LOG_WARNING("Function: %s, error code: %s.",
                             __func__,
                             NRFX_LOG_ERROR_STRING_GET(err_code));
            return err_code;
        }
    }

    NRFX_LOG_INFO("GRTC RTCOUNTER compare disabled.");
    return err_code;
}

void nrfx_grtc_rtcomparesync_int_enable(nrfx_grtc_rtcomparesync_handler_t handler, void * p_context)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    m_cb.rtcomparesync_handler = handler;
    m_cb.rtcomparesync_context = p_context;
    nrfy_grtc_event_clear(NRF_GRTC, NRF_GRTC_EVENT_RTCOMPARESYNC);
    nrfy_grtc_int_enable(NRF_GRTC, NRFY_EVENT_TO_INT_BITMASK(NRF_GRTC_EVENT_RTCOMPARESYNC));
    NRFX_LOG_INFO("GRTC RTCOMPARESYNC interrupt enabled.");
}

void nrfx_grtc_rtcomparesync_int_disable(void)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_INT_RTCOMPARESYNC_MASK);
    NRFX_LOG_INFO("GRTC RTCOMPARESYNC interrupt disabled.");
}

int nrfx_grtc_rtcounter_cc_absolute_set(nrfx_grtc_rtcounter_handler_data_t * p_handler_data,
                                        uint64_t                             val,
                                        bool                                 enable_irq,
                                        bool                                 sync)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) && p_handler_data);
    int err_code = 0;

    if (is_syscounter_running())
    {
        err_code = -ECANCELED;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    nrfx_grtc_channel_t * p_chan_data = &m_cb.channel_data[GRTC_RTCOUNTER_CC_HANDLER_IDX];

    p_chan_data->handler   = p_handler_data->handler;
    p_chan_data->p_context = p_handler_data->p_context;
    p_chan_data->channel   = GRTC_RTCOUNTER_COMPARE_CHANNEL;

    NRFX_CRITICAL_SECTION_ENTER();
    nrfy_grtc_rt_counter_cc_set(NRF_GRTC, val, sync);
    NRFX_CRITICAL_SECTION_EXIT();

    nrf_grtc_event_t event = NRF_GRTC_EVENT_RTCOMPARE;

    nrfy_grtc_event_clear(NRF_GRTC, event);
    if (enable_irq)
    {
        nrfy_grtc_int_enable(NRF_GRTC, NRFY_EVENT_TO_INT_BITMASK(event));
    }

    NRFX_LOG_INFO("GRTC RTCOUNTER compare set to %llu.", val);
    return err_code;
}
#endif // NRF_GRTC_HAS_RTCOUNTER

#if NRFY_GRTC_HAS_EXTENDED
int nrfx_grtc_syscounter_start(bool busy_wait, uint8_t * p_main_cc_channel)
{
    int rv;

    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);

    if (is_syscounter_running())
    {
        rv = -EALREADY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(rv));
        return rv;
    }

    nrfy_grtc_sys_counter_start(NRF_GRTC, busy_wait);
#if NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOEN)
    uint32_t startup_timeout = STARTUP_TIMEOUT;

    while ((startup_timeout > 0) && (!ready_check()))
    {
        startup_timeout--;
    }
    if (startup_timeout == 0)
    {
        return -ETIMEDOUT;
    }
#endif /* NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOEN) */
    NRFX_LOG_INFO("GRTC SYSCOUNTER started.");

    rv = channel_allocate(p_main_cc_channel, UINT32_MAX);
    if (rv < 0)
    {
        return rv;
    }
    channel_used_mark(*p_main_cc_channel);
    return 0;
}

int nrfx_grtc_action_perform(nrfx_grtc_action_t action)
{
    NRFX_ASSERT(m_cb.state == NRFX_DRV_STATE_INITIALIZED);
    int err_code = 0;

    if (is_syscounter_running())
    {
        err_code = -ECANCELED;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));

        return err_code;
    }

    nrf_grtc_task_t task = (nrf_grtc_task_t)action;
    nrfy_grtc_task_trigger(NRF_GRTC, task);

    NRFX_LOG_INFO("GRTC %s action.", GRTC_ACTION_TO_STR(action));
    return err_code;
}
#endif // NRFY_GRTC_HAS_EXTENDED

void nrfx_grtc_uninit(void)
{
    uint32_t ch_mask = allocated_channels_mask_get();

