andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/drivers/src/nrfx_grtc.c
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, GRTC_ALL_INT_MASK);

    for (uint8_t chan = 0; ch_mask; chan++, ch_mask >>= 1)
    {
        if (is_channel_used(chan))
        {
            channel_used_unmark(chan);
        }
        if (is_channel_allocated(chan))
        {
            nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, chan);
            if (ch_mask & 0x1)
            {
                (void)channel_free(chan);
            }
        }
    }
    nrfy_grtc_int_uninit(NRF_GRTC);

    nrfy_grtc_sys_counter_active_set(NRF_GRTC, false);

#if NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART)
    nrfy_grtc_sys_counter_auto_mode_set(NRF_GRTC, false);
    nrfy_grtc_sys_counter_set(NRF_GRTC, false);
#if NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_STOP_AT_UNINIT)
    nrf_grtc_task_trigger(NRF_GRTC, NRF_GRTC_TASK_STOP);
#endif
#if NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_CLEAR_AT_UNINIT)
    nrf_grtc_task_trigger(NRF_GRTC, NRF_GRTC_TASK_CLEAR);
#endif
#endif // NRFY_GRTC_HAS_EXTENDED && NRFX_IS_ENABLED(NRFX_GRTC_CONFIG_AUTOSTART)

    m_cb.state = NRFX_DRV_STATE_UNINITIALIZED;
    NRFX_LOG_INFO("GRTC uninitialized.");
}

bool nrfx_grtc_init_check(void)
{
    return (m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
}

#if NRF_GRTC_HAS_RTCOUNTER
void nrfx_grtc_rtcounter_cc_int_enable(bool sync)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    nrf_grtc_event_t event = sync ? NRF_GRTC_EVENT_RTCOMPARE : NRF_GRTC_EVENT_RTCOMPARESYNC;

    nrfy_grtc_event_clear(NRF_GRTC, event);
    nrfy_grtc_int_enable(NRF_GRTC, NRFY_EVENT_TO_INT_BITMASK(event));
    NRFX_LOG_INFO("GRTC RTCOMPARE%s interrupt enabled.", sync ? "SYNC" : "");
}

void nrfx_grtc_rtcounter_cc_int_disable(void)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_INT_RTCOMPARE_MASK | NRF_GRTC_INT_RTCOMPARESYNC_MASK);
    NRFX_LOG_INFO("GRTC RTCOMPARE/RTCOMPARESYNC interrupt disabled.");
}
#endif // NRF_GRTC_HAS_RTCOUNTER

#if NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
void nrfx_grtc_syscountervalid_int_enable(nrfx_grtc_syscountervalid_handler_t handler,
                                          void *                              p_context)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    m_cb.syscountervalid_handler = handler;
    m_cb.syscountervalid_context = p_context;
    nrfy_grtc_int_enable(NRF_GRTC, NRFY_EVENT_TO_INT_BITMASK(NRF_GRTC_EVENT_SYSCOUNTERVALID));
    NRFX_LOG_INFO("GRTC SYSCOUNTERVALID interrupt enabled.");
}

void nrfx_grtc_syscountervalid_int_disable(void)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_INT_SYSCOUNTERVALID_MASK);
    NRFX_LOG_INFO("GRTC SYSCOUNTERVALID interrupt disabled.");
}
#endif // NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID

int nrfx_grtc_syscounter_cc_disable(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    uint32_t   int_mask = NRF_GRTC_CHANNEL_INT_MASK(channel);
    int err_code = syscounter_check(channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    channel_used_unmark(channel);

    nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, channel);

    if (nrfy_grtc_int_enable_check(NRF_GRTC, int_mask))
    {
        nrfy_grtc_int_disable(NRF_GRTC, int_mask);
        if (nrfy_grtc_sys_counter_compare_event_check(NRF_GRTC, channel))
        {
            nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, channel);
            err_code = -ETIMEDOUT;
            NRFX_LOG_WARNING("Function: %s, error code: %s.",
                             __func__,
                             NRFX_LOG_ERROR_STRING_GET(err_code));
            return err_code;
        }
    }
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare for channel %u disabled.", (uint32_t)channel);
    return err_code;
}

void nrfx_grtc_syscounter_cc_abs_set(uint8_t channel, uint64_t val, bool safe_setting)
{
    NRFX_ASSERT(syscounter_check(channel) == 0);

    m_cb.cc_value[m_cb.ch_to_data[channel]] = val;
    if (safe_setting)
    {
        nrfy_grtc_sys_counter_cc_set(NRF_GRTC, channel, val);
        if (nrfy_grtc_sys_counter_compare_event_check(NRF_GRTC, channel))
        {
            uint64_t now;

            now = nrfx_grtc_syscounter_get();
            if (val > now)
            {
                nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, channel);
            }
        }
    }
    else
    {
        nrfy_grtc_sys_counter_cc_set(NRF_GRTC, channel, val);
    }
}

int nrfx_grtc_syscounter_cc_absolute_set(nrfx_grtc_channel_t * p_chan_data,
                                         uint64_t              val,
                                         bool                  enable_irq)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) && p_chan_data);
    int err_code = syscounter_check(p_chan_data->channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    cc_channel_prepare(p_chan_data);
    NRFX_CRITICAL_SECTION_ENTER();
    nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, p_chan_data->channel);
    nrfy_grtc_sys_counter_cc_set(NRF_GRTC, p_chan_data->channel, val);
    NRFX_CRITICAL_SECTION_EXIT();

    if (enable_irq)
    {
        NRFX_ATOMIC_FETCH_OR(&m_cb.read_cc_mask, NRFX_BIT(p_chan_data->channel));
        nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(p_chan_data->channel));
    }

    NRFX_LOG_INFO("GRTC SYSCOUNTER absolute compare for channel %u set to %u.",
                  (uint32_t)p_chan_data->channel,
                  (uint32_t)nrfy_grtc_sys_counter_cc_get(NRF_GRTC, p_chan_data->channel));
    return err_code;
}

#if NRFY_GRTC_HAS_INTERVAL || NRFY_GRTC_HAS_MINTERVAL
void nrfx_grtc_syscounter_cc_interval_set(uint8_t channel, uint32_t start_val, uint32_t val)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) &&
                (syscounter_check(channel) == 0) &&
                (NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK != 0));

