andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/drivers/src/nrfx_grtc.c
    nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, channel);
#if NRFY_GRTC_HAS_MINTERVAL
    nrfy_grtc_sys_counter_minterval_set(NRF_GRTC, channel, val);
#else
    nrfy_grtc_sys_counter_interval_set(NRF_GRTC, val);
#endif
    nrfy_grtc_sys_counter_cc_add_set(NRF_GRTC,
                                     channel,
                                     start_val,
                                     NRF_GRTC_CC_ADD_REFERENCE_SYSCOUNTER);
}

void nrfx_grtc_syscounter_cc_interval_reset(uint8_t channel)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) &&
                (syscounter_check(channel) == 0) &&
                (NRFX_GRTC_CONFIG_EXTENDED_CC_CHANNELS_MASK != 0));

    nrfy_grtc_sys_counter_compare_event_disable(NRF_GRTC, channel);
#if NRFY_GRTC_HAS_MINTERVAL
    nrfy_grtc_sys_counter_minterval_set(NRF_GRTC, channel, 0);
#else
    nrfy_grtc_sys_counter_interval_set(NRF_GRTC, 0);
#endif
}

#endif

void nrfx_grtc_syscounter_cc_rel_set(uint8_t channel,
                                     uint32_t val,
                                     nrfx_grtc_cc_relative_reference_t reference)
{
    NRFX_ASSERT(syscounter_check(channel) == 0);

    m_cb.cc_value[m_cb.ch_to_data[channel]] += val;
    nrfy_grtc_sys_counter_cc_add_set(NRF_GRTC,
                                     channel,
                                     val,
                                     (nrf_grtc_cc_add_reference_t)reference);
}

int nrfx_grtc_syscounter_cc_relative_set(nrfx_grtc_channel_t *             p_chan_data,
                                         uint32_t                          val,
                                         bool                              enable_irq,
                                         nrfx_grtc_cc_relative_reference_t reference)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) && p_chan_data);
    int err_code = syscounter_check(p_chan_data->channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    cc_channel_prepare(p_chan_data);
    NRFX_CRITICAL_SECTION_ENTER();
    nrfy_grtc_sys_counter_compare_event_clear(NRF_GRTC, p_chan_data->channel);
    {
        nrfy_grtc_sys_counter_cc_add_set(NRF_GRTC,
                                         p_chan_data->channel,
                                         val,
                                         (nrf_grtc_cc_add_reference_t)reference);
    }
    NRFX_CRITICAL_SECTION_EXIT();

    if (enable_irq)
    {
        NRFX_ATOMIC_FETCH_OR(&m_cb.read_cc_mask, NRFX_BIT(p_chan_data->channel));
        nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(p_chan_data->channel));
    }

    NRFX_LOG_INFO("GRTC SYSCOUNTER compare for channel %u set to %u.",
                  (uint32_t)p_chan_data->channel,
                  (uint32_t)val);
    return err_code;
}

int nrfx_grtc_syscounter_cc_int_disable(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    int err_code = syscounter_check(channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    if (!is_channel_used(channel))
    {
        err_code = -EINVAL;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    nrfy_grtc_int_disable(NRF_GRTC, NRF_GRTC_CHANNEL_INT_MASK(channel));
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare interrupt for channel %u disabled.", (uint32_t)channel);
    return err_code;
}

int nrfx_grtc_syscounter_cc_int_enable(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    int err_code = syscounter_check(channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    channel_used_mark(channel);
    nrfy_grtc_int_enable(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(channel));
    NRFX_LOG_INFO("GRTC SYSCOUNTER compare interrupt for channel %u enabled.", (uint32_t)channel);
    return err_code;
}

bool nrfx_grtc_syscounter_cc_int_enable_check(uint8_t channel)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) &&
                (channel < NRF_GRTC_SYSCOUNTER_CC_COUNT));
    return nrfy_grtc_int_enable_check(NRF_GRTC, GRTC_CHANNEL_TO_BITMASK(channel));
}

int nrfx_grtc_syscounter_capture(uint8_t channel)
{
    NRFX_ASSERT(m_cb.state != NRFX_DRV_STATE_UNINITIALIZED);
    int err_code = syscounter_check(channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    channel_used_mark(channel);
    nrfy_grtc_task_trigger(NRF_GRTC, nrfy_grtc_sys_counter_capture_task_get(channel));

    NRFX_LOG_INFO("GRTC SYSCOUNTER capture for channel %u triggered.", (uint32_t)channel);
    return err_code;
}

int nrfx_grtc_syscounter_cc_value_read(uint8_t channel, uint64_t * p_val)
{
    NRFX_ASSERT((m_cb.state != NRFX_DRV_STATE_UNINITIALIZED) && p_val);
    int err_code = syscounter_check(channel);
    if (err_code != 0)
    {
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    if (!is_channel_used(channel))
    {
        err_code = -EINVAL;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }

    *p_val = nrfy_grtc_sys_counter_cc_get(NRF_GRTC, channel);

    NRFX_LOG_INFO("GRTC SYSCOUNTER capture for channel %u read: %llu.", (uint32_t)channel, *p_val);
    return err_code;
}

#if NRF_GRTC_HAS_RTCOUNTER || (NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID)
#define GRTC_EXT 1
#endif

