andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/drivers/src/nrfx_grtc.c
static void grtc_irq_handler(void)
{
    uint32_t intpend = nrfy_grtc_int_pending_get(NRF_GRTC);

    while (intpend)
    {
        uint8_t idx = (uint8_t)NRFX_CTZ(intpend);

        intpend &= ~NRFX_BIT(idx);

        if (!NRFX_IS_ENABLED(GRTC_EXT) || idx < NRF_GRTC_SYSCOUNTER_CC_COUNT)
        {
            uint32_t i = m_cb.ch_to_data[idx];

            NRFX_ASSERT(m_cb.channel_data[i].channel == idx);

            if (m_cb.channel_data[i].handler)
            {
                uint64_t cc_value;

                if (NRFX_ATOMIC_FETCH_AND(&m_cb.read_cc_mask, ~NRFX_BIT(idx)) & NRFX_BIT(idx))
                {
                    /* Read CC value only if channel was set using legacy functions. It is done
                     * for API backward compatibility. Reading 64 bit value from GRTC is costly
                     * and it is avoided if possible.
                     */
                    cc_value = nrfy_grtc_sys_counter_cc_get(NRF_GRTC, idx);
                }
                else
                {
                    /* If CC was set using optimized API then CC is stored in RAM (much faster
                     * access).
                     */
                    cc_value = m_cb.cc_value[i];
                }

                /* Check event again (initially checked via INTPEND). It is possible that
                 * CC is reconfigured from higher priority context. In that case event
                 * might be cleared.
                 */
                if (!nrf_grtc_event_check(NRF_GRTC, NRFY_INT_BITPOS_TO_EVENT(idx)))
                {
                    continue;
                }

                nrf_grtc_event_clear(NRF_GRTC, NRFY_INT_BITPOS_TO_EVENT(idx));

                m_cb.channel_data[i].handler(idx, cc_value, m_cb.channel_data[i].p_context);
            }
            else if (nrf_grtc_event_check(NRF_GRTC, NRFY_INT_BITPOS_TO_EVENT(idx)))
            {
                nrf_grtc_event_clear(NRF_GRTC, NRFY_INT_BITPOS_TO_EVENT(idx));
            }
        }
#if NRF_GRTC_HAS_RTCOUNTER
        if (idx == NRFY_EVENT_TO_INT_BITPOS(NRF_GRTC_EVENT_RTCOMPARE))
        {
            nrf_grtc_event_clear(NRF_GRTC, NRFY_INT_BITPOS_TO_EVENT(idx));
            nrfx_grtc_channel_t const * p_channel =
                                &m_cb.channel_data[GRTC_RTCOUNTER_CC_HANDLER_IDX];
            if (p_channel->handler)
            {
                p_channel->handler((int32_t)GRTC_RTCOUNTER_COMPARE_CHANNEL,
                                   nrfy_grtc_rt_counter_cc_get(NRF_GRTC),
                                   p_channel->p_context);
            }
         }
#endif // NRF_GRTC_HAS_RTCOUNTER
#if NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
        if (idx == NRFY_EVENT_TO_INT_BITPOS(NRF_GRTC_EVENT_SYSCOUNTERVALID))
        {
            /* The SYSCOUNTERVALID bit is automatically cleared when GRTC goes into sleep state
             * and set when returning from this state. It can't be cleared inside the ISR
             * procedure because we rely on it during SYSCOUNTER value reading procedure. */
            NRFX_LOG_INFO("Event: NRF_GRTC_EVENT_SYSCOUNTERVALID.");
            nrf_grtc_event_clear(NRF_GRTC, NRFY_INT_BITPOS_TO_EVENT(idx));
            if (m_cb.syscountervalid_handler)
            {
                m_cb.syscountervalid_handler(m_cb.syscountervalid_context);
            }
        }
#endif // NRFY_GRTC_HAS_EXTENDED && NRFY_GRTC_HAS_SYSCOUNTERVALID
    }
}

void nrfx_grtc_irq_handler(void)
{
    grtc_irq_handler();
}
#endif // NRFX_CHECK(NRFX_GRTC_ENABLED)
